Учёт/МойУчёт/src/Documents/ВводВремени/ВводВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводВремени</name>
  <registerRecords>AccumulationRegister.Время</registerRecords>
  <attributes>
    <name>С</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>По_</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Старт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьВЧасах</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статья</name>
      <type>
        <types>CatalogRef.СтатьиДДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыставления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учёт/МойУчёт/src/AccumulationRegisters/Время/Время.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Время</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Время</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыставления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиДДС</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Учёт/МойУчёт/src/Documents/ВводВремени/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Для каждого СтрокаТЧ Из Состав Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Старт) И ЗначениеЗаполнено(СтрокаТЧ.Статья) И ЗначениеЗаполнено(СтрокаТЧ.ПродолжительностьВЧасах) Тогда
			НоваяЗапись = Движения.Время.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТЧ);
			НоваяЗапись.Период = СтрокаТЧ.Старт;
			НоваяЗапись.Время = СтрокаТЧ.ПродолжительностьВЧасах;
			КонецПериодаВключительно = СтрокаТЧ.Старт + СтрокаТЧ.ПродолжительностьВЧасах * 3600 - 1;
			Если День(СтрокаТЧ.Старт) <> День(КонецПериодаВключительно) Тогда
				НачалоЗавтра = НачалоДня(КонецПериодаВключительно);
				НоваяЗапись.Время = (НачалоЗавтра - СтрокаТЧ.Старт) / 3600;
				НоваяЗапись = Движения.Время.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТЧ);
				НоваяЗапись.Период = НачалоЗавтра;
				НоваяЗапись.Время = (КонецПериодаВключительно - НачалоЗавтра + 1) / 3600;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
